In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\demst\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (8.3.0)

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: C:\Users\demst\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [120]:
import mysql.connector
from mysql.connector import Error

## SCRIPT DE CONEXIÓN A LA BASE DE DATOS

In [138]:
try: 
    connection = mysql.connector.connect(host='xxx', 
                                         database='xxx',
                                         user='xxx',
                                         password='xxx', connection_timeout=180)

    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL database... MySQL Server version on ", db_Info)

        cursor = connection.cursor() # Objeto importante para facilitar la ejecución de los comandos necesarios
        connection.commit() # Para aplicar los cambios

except Error as e:
    print("Error while connecting to MySQL", e)
finally:
    # closing database connection.
    if connection.is_connected():
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

Connected to MySQL database... MySQL Server version on  5.7.44-48-log
MySQL connection is closed

### EJEMPLO DE CONEXIÓN A UNA BASE DE DATOS DE MYSQL

In [139]:
connection = mysql.connector.connect(host='xxx',
                                     database='xxx',
                                     user='xxx',
                                     password='xxx', connection_timeout=180000)

In [140]:
#conectamos el cursor, objeto importante para facilitar la ejecución de los comandos necesarios
cursor=connection.cursor()

### Ejercicio 1: Obtener el listado de todos los productos

In [10]:
query1 = ''' SELECT * FROM PRODUCTO; '''
cursor.execute(query1)
cursor.fetchall()

[('01', 'Hamburguesa', 2.6),
 ('02', 'Patatas', 2.0),
 ('03', 'tomate', 0.5),
 ('04', 'Queso', 1.0),
 ('05', 'Lechuga', 0.5),
 ('06', 'Pollo', 3.6),
 ('08', 'Bacon', 1.5),
 ('09', 'Coca cola', 3.0),
 ('10', 'Nestea', 3.0),
 ('11', 'Menú de Pollo', 5.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0),
 ('13', 'Menú de Pollo con queso', 6.0),
 ('14', 'Menú de Hamburguesa', 6.0),
 ('15', 'Helado', 1.0),
 ('16', 'Tarta', 2.0),
 ('17', 'Fruta', 1.0),
 ('18', 'Agua', 2.0),
 ('19', 'Fanta', 3.0)]

In [5]:
import pandas as pd

Para poder visualizar la tabla, pasamos el query a dataframe

In [6]:
df1 = pd.read_sql(query1, connection) # Para verlo en formato dataframe de pandas
df1

C:\Users\kina5\AppData\Local\Temp\ipykernel_13372\3656051463.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql(query1, connection)

   Codigo                         Nombre  Precio
0      01                    Hamburguesa     2.6
1      02                        Patatas     2.0
2      03                         tomate     0.5
3      04                          Queso     1.0
4      05                        Lechuga     0.5
5      06                          Pollo     3.6
6      08                          Bacon     1.5
7      09                      Coca cola     3.0
8      10                         Nestea     3.0
9      11                  Menú de Pollo     5.0
10     12  Menú de Hamburguesa con queso     6.0
11     13        Menú de Pollo con queso     6.0
12     14            Menú de Hamburguesa     6.0
13     15                         Helado     1.0
14     16                          Tarta     2.0
15     17                          Fruta     1.0
16     18                           Agua     2.0
17     19                          Fanta     3.0

### Ejercicio 2: Obtener el número de pedido, dni del repartidor y hora de reparto de aquellos pedidos que se toman nota después de las siete de la tarde

In [11]:
query2 = """ SELECT Numero, DNI_R, hora_tm
FROM PEDIDO
WHERE hora_tm > '19:00:00'
AND DNI_R IS NOT null; """
cursor.execute(query2)
cursor.fetchall()

[('0005', '14188151T', datetime.timedelta(seconds=68520)),
 ('0006', '04477744T', datetime.timedelta(seconds=75720)),
 ('0007', '14188151T', datetime.timedelta(seconds=83100))]

In [12]:
df2 = pd.read_sql(query2, con=connection)
df2

C:\Users\kina5\AppData\Local\Temp\ipykernel_13372\3976681190.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql(query2, con=connection)

  Numero      DNI_R         hora_tm
0   0005  14188151T 0 days 19:02:00
1   0006  04477744T 0 days 21:02:00
2   0007  14188151T 0 days 23:05:00

### Ejercicio 3: Obtener todos los campos de empleados que cobran entre 900 y 1000 euros.

In [18]:
query3 = """ SELECT *
FROM EMPLEADO
WHERE Salario BETWEEN 900 and 1000; """
cursor.execute(query3)
cursor.fetchall()

[('04444444T', 'Úrsula Delta Camacho', '11177788899', 'mañana', 900.0),
 ('11111111Q', 'Luis Ramírez Pardo', '23445556666', 'mañana', 900.0),
 ('14111155T', 'Sergio Lérida Campos', '55577700089', 'tarde', 1000.0),
 ('22222222S', 'María Sánchez Cid', '11112223334', 'tarde', 1000.0),
 ('33333333M', 'Martín Guerrero López', '33344455566', 'tarde', 1000.0),
 ('55555555J', 'Carmen Hernández Pío', '99966633311', 'mañana', 900.0),
 ('77777777M', 'Pedro Jiménez Ruiz', '23456785432', 'tarde', 1000.0),
 ('99999999X', 'Raúl Rodrigo Roca', '55566677789', 'tarde', 1000.0)]

### Ejercicio 4: Obtener el número de pedido e importe de aquellos que han sido registrados en el mes de noviembre de 2020 y su importe es mayor a 15 Euros.

In [19]:
query4 = """ SELECT Numero, Importe
FROM PEDIDO
WHERE Fecha LIKE '2020-11%' and Importe > 15; """
cursor.execute(query4)
cursor.fetchall()

[('0006', 23.0), ('0009', 25.0), ('0010', 45.0), ('0011', 45.0)]

### Ejercicio 5: Obtener por cada uno de los repartidores su DNI junto a la cantidad de pedidos entregados.

In [20]:
query5 = """ SELECT DNI_R, COUNT(*) /* Dentro de COUNT también podemos poner solo una variable, como Numero */
FROM PEDIDO
WHERE DNI_R IS NOT NULL
GROUP BY DNI_R; """
cursor.execute(query5)
cursor.fetchall()

[('04477744T', 2),
 ('11245621Q', 1),
 ('14188151T', 2),
 ('55675675J', 1),
 ('99009900J', 3)]

### Ejercicio 6: Obtener por cada mes (con el formato de nombre y no de número ej. Noviembre), la cantidad de pedidos realizados.

In [21]:
query6 = """ SELECT MONTHNAME(p.fecha) AS Mes, COUNT(p.Numero) AS 'Pedidos Realizados'
FROM PEDIDO p
GROUP BY MONTHNAME(p.fecha); """
cursor.execute(query6)
cursor.fetchall()

[('November', 6), ('October', 2), ('September', 3)]

### Ejercicio 7: Obtener un listado con el nombre y dni de los empleados en el mismo campo y anteponiendo el dni al nombre de la siguiente forma (ej; 45776633P, Juan Rodríguez López) que tenga turno de “tarde” o "noche". Ordenar el listado por dni.

In [22]:
query7 = """ SELECT CONCAT (e.DNI,', ',e.Nombre) AS Nombre_DNI, e.Turno /* He añadido e.Turno para que salga el turno de cada uno */
FROM EMPLEADO e
WHERE e.Turno IN ('Tarde','Noche') IS NOT NULL
ORDER BY e.DNI; """
cursor.execute(query7)
cursor.fetchall()

[('03232323P, María Luisa Galdón Ter', 'noche'),
 ('04444444T, Úrsula Delta Camacho', 'mañana'),
 ('11111111Q, Luis Ramírez Pardo', 'mañana'),
 ('14111155T, Sergio Lérida Campos', 'tarde'),
 ('14567555L, Piedad Colmenero Zapillo', 'noche'),
 ('22222222S, María Sánchez Cid', 'tarde'),
 ('33333333M, Martín Guerrero López', 'tarde'),
 ('55555555J, Carmen Hernández Pío', 'mañana'),
 ('77777777M, Pedro Jiménez Ruiz', 'tarde'),
 ('88888888O, Soledad Campillo Molina', 'noche'),
 ('99999999X, Raúl Rodrigo Roca', 'tarde')]

### Ejercicio 8: Obtener el nombre, código y precio de aquellos productos que superen o igualen la media de todos los precios. Ordenar de mayor a menor precio.

In [24]:
query8 = """ SELECT Nombre, Codigo, Precio
FROM PRODUCTO
WHERE Precio >=  (SELECT AVG(Precio) FROM PRODUCTO) /* Usando subconsulta */
ORDER BY Precio DESC; """
cursor.execute(query8)
cursor.fetchall()

[('Menú de Hamburguesa con queso', '12', 6.0),
 ('Menú de Pollo con queso', '13', 6.0),
 ('Menú de Hamburguesa', '14', 6.0),
 ('Menú de Pollo', '11', 5.0),
 ('Pollo', '06', 3.6),
 ('Coca cola', '09', 3.0),
 ('Nestea', '10', 3.0),
 ('Fanta', '19', 3.0)]

### Ejercicio 9: Obtener un listado con el nombre y DNI de los empleados que no han preparado nunca ningún pedido.

In [30]:
query9 = """ SELECT Nombre, DNI
FROM EMPLEADO
WHERE DNI NOT IN (SELECT DNI_EP FROM PEDIDO); """
cursor.execute(query9)
cursor.fetchall()

[('Luis Ramírez Pardo', '11111111Q'),
 ('Sergio Lérida Campos', '14111155T'),
 ('Raúl Rodrigo Roca', '99999999X')]

### Ejercicio 10: Obtener el código, nombre y precio de los productos (estos dos últimos en el mismo campo) que están contenidos en los pedidos que ha tomado nota "Luis" o "María Luisa". Ordena el listado de mayor a menor valor por fecha del pedido.

In [36]:
query10 = """ SELECT p.Codigo, CONCAT(p.Nombre,' - ',p.Precio) AS 'Nombre - Precio' FROM PRODUCTO p
JOIN consta c ON p.Codigo = c.Codigo_Pr
JOIN PEDIDO pe ON c.Numero_P = pe.Numero
JOIN EMPLEADO e ON pe.DNI_ETM = e.DNI
WHERE e.Nombre LIKE 'María Luisa%' 
OR e.Nombre LIKE 'Luis%'
ORDER BY pe.Fecha DESC; """
cursor.execute(query10)
cursor.fetchall()

[('12', 'Menú de Hamburguesa con queso - 6.00'),
 ('11', 'Menú de Pollo - 5.00'),
 ('02', 'Patatas - 2.00'),
 ('09', 'Coca cola - 3.00'),
 ('12', 'Menú de Hamburguesa con queso - 6.00')]

### Ejercicio 11: Obtener por cada repartidor, su nombre, cantidad de pedidos y el tiempo medio que tardan en entregar los pedidos una vez preparados. Ordenar el listado el tiempo medio que tardan en entregarlos.

In [38]:
query11 = """ SELECT
	r.Nombre AS 'Nombre repartidor',
    COUNT(pe.Numero) AS 'Pedidos totales',
    TIME_FORMAT(AVG(TIMEDIFF(Hora_rep,Hora_pre)),'%T') AS 'Tiempo medio de entrega'
FROM REPARTIDOR r
JOIN PEDIDO pe ON r.DNI = pe.DNI_R
GROUP BY r.Nombre
ORDER BY 3; """
cursor.execute(query11)
cursor.fetchall()

[('Laura Jiménez Jiménez', 2, '00:12:50'),
 ('Juan Pardo Rubio', 1, '00:15:00'),
 ('Carlos Sánchez Ruíz', 2, '00:19:00'),
 ('Alejandro Pardo López', 3, '00:25:00'),
 ('Juan Sánchez López', 1, '00:30:00')]

### Ejercicio 12: Obtener un listado obteniendo el código, nombre y el precio de los productos cuyo precios sea el más barato o el más caro de todos.

In [43]:
query12 = """ SELECT Codigo, Nombre, Precio
FROM PRODUCTO
WHERE Precio = (SELECT MIN(Precio) FROM PRODUCTO)
   OR Precio = (SELECT MAX(Precio) FROM PRODUCTO); """
cursor.execute(query12)
cursor.fetchall()

[('03', 'tomate', 0.5),
 ('05', 'Lechuga', 0.5),
 ('12', 'Menú de Hamburguesa con queso', 6.0),
 ('13', 'Menú de Pollo con queso', 6.0),
 ('14', 'Menú de Hamburguesa', 6.0)]

### Ejercicio 13: Obtener por cada producto , el nombre y código el número total de pedidos en los que se encuentra teniendo en cuenta que el total de pedidos en los cuales se encuentre sea superior o igual a dos. Ordena el listado de mayor a menor número de productos.

In [142]:
query13 = """ SELECT p.Nombre, p.Codigo, COUNT(pe.Numero) AS 'Número total de pedidos con este producto'
FROM PRODUCTO p
JOIN consta c ON p.Codigo = c.Codigo_PR
JOIN PEDIDO pe ON c.Numero_P = pe.Numero
GROUP BY p.Nombre, p.Codigo
HAVING COUNT(pe.Numero) >= 2 
ORDER BY COUNT(pe.Numero) DESC; """
cursor.execute(query13)
cursor.fetchall()

[('Menú de Hamburguesa con queso', '12', 6),
 ('Menú de Pollo con queso', '13', 6),
 ('Queso', '04', 3),
 ('Menú de Pollo', '11', 3),
 ('Patatas', '02', 2),
 ('Helado', '15', 2)]

In [143]:
df13 = pd.read_sql(query13, connection) 
df13

C:\Users\kina5\AppData\Local\Temp\ipykernel_13372\1378722908.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df13 = pd.read_sql(query13, connection)

,Nombre,Codigo,Número total de pedidos con este producto
0,Menú de Pollo con queso,13,6
1,Menú de Hamburguesa con queso,12,6
2,Menú de Pollo,11,3
3,Queso,04,3
4,Helado,15,2
5,Patatas,02,2

### Ejercicio 14: Mostrar listado de los empleados (código y NSS en la misma columna) que han tomado nota de algún pedido y contienen el producto de código 13 y además el repartidor sea 'Laura'.

In [91]:
query14 = """ SELECT e.Nombre, CONCAT(e.DNI, '-',e.Nss) AS 'DNI - NSS' FROM EMPLEADO e 
JOIN PEDIDO p ON e.DNI = p.DNI_ETM
JOIN consta c ON p.Numero = c.Numero_P
JOIN PRODUCTO pr ON c.Codigo_Pr = pr.Codigo
JOIN REPARTIDOR r ON p.DNI_R = r.DNI
WHERE c.Codigo_Pr = '13'
AND r.Nombre LIKE 'Laura%'; """
cursor.execute(query14)
cursor.fetchall()

[('Raúl Rodrigo Roca', '99999999X-55566677789'),
 ('Piedad Colmenero Zapillo', '14567555L-23456734534')]

### Ejercicio 15: Obtener el nombre del producto que es menú junto con el código de los productos que lo componen en aquellos pedidos del mes de septiembre de 2020.

In [130]:
query15 = """ SELECT p.Nombre AS 'Nombre del producto que compone el pedido', p.Codigo AS 'Código producto', ec.Codigo_P_compuesto AS 'Código producto que lo compone', PRODUCTO.Nombre as 'Descripción producto que lo compone'
FROM PRODUCTO p
JOIN esta_compuesto ec ON p.Codigo = ec.Codigo_P -- El esta_compuesto son todos menús, así que no tengo que especificar que solo quiero los menús
JOIN consta c ON p.Codigo = c.codigo_Pr
JOIN PEDIDO pe ON c.Numero_P = pe.Numero
JOIN PRODUCTO PRODUCTO ON Codigo_P_compuesto = PRODUCTO.codigo
WHERE pe.Fecha BETWEEN '2020-09-01' AND '2020-09-30'; """
cursor.execute(query15)
cursor.fetchall()

[('Menú de Hamburguesa con queso', '12', '01', 'Hamburguesa'),
 ('Menú de Hamburguesa con queso', '12', '02', 'Patatas'),
 ('Menú de Hamburguesa con queso', '12', '04', 'Queso'),
 ('Menú de Hamburguesa con queso', '12', '10', 'Nestea'),
 ('Menú de Hamburguesa con queso', '12', '16', 'Tarta'),
 ('Menú de Pollo con queso', '13', '02', 'Patatas'),
 ('Menú de Pollo con queso', '13', '04', 'Queso'),
 ('Menú de Pollo con queso', '13', '06', 'Pollo'),
 ('Menú de Pollo con queso', '13', '08', 'Bacon'),
 ('Menú de Pollo con queso', '13', '09', 'Coca cola'),
 ('Menú de Pollo con queso', '13', '15', 'Helado'),
 ('Menú de Hamburguesa con queso', '12', '01', 'Hamburguesa'),
 ('Menú de Hamburguesa con queso', '12', '02', 'Patatas'),
 ('Menú de Hamburguesa con queso', '12', '04', 'Queso'),
 ('Menú de Hamburguesa con queso', '12', '10', 'Nestea'),
 ('Menú de Hamburguesa con queso', '12', '16', 'Tarta'),
 ('Menú de Pollo', '11', '02', 'Patatas'),
 ('Menú de Pollo', '11', '03', 'tomate'),
 ('Menú de Pollo', '11', '06', 'Pollo'),
 ('Menú de Pollo', '11', '17', 'Fruta'),
 ('Menú de Pollo', '11', '18', 'Agua'),
 ('Menú de Pollo con queso', '13', '02', 'Patatas'),
 ('Menú de Pollo con queso', '13', '04', 'Queso'),
 ('Menú de Pollo con queso', '13', '06', 'Pollo'),
 ('Menú de Pollo con queso', '13', '08', 'Bacon'),
 ('Menú de Pollo con queso', '13', '09', 'Coca cola'),
 ('Menú de Pollo con queso', '13', '15', 'Helado')]

In [131]:
df15 = pd.read_sql(query15, connection) 
df15

C:\Users\kina5\AppData\Local\Temp\ipykernel_13372\3366465357.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df15 = pd.read_sql(query15, connection)

,Nombre del producto que compone el pedido,Código producto,Código producto que lo compone,Descripción producto que lo compone
0,Menú de Hamburguesa con queso,12,01,Hamburguesa
1,Menú de Hamburguesa con queso,12,02,Patatas
2,Menú de Hamburguesa con queso,12,04,Queso
3,Menú de Hamburguesa con queso,12,10,Nestea
4,Menú de Hamburguesa con queso,12,16,Tarta
5,Menú de Pollo con queso,13,02,Patatas
6,Menú de Pollo con queso,13,04,Queso
7,Menú de Pollo con queso,13,06,Pollo
8,Menú de Pollo con queso,13,08,Bacon
9,Menú de Pollo con queso,13,09,Coca cola
10,Menú de Pollo con queso,13,15,Helado
11,Menú de Hamburguesa con queso,12,01,Hamburguesa
12,Menú de Hamburguesa con queso,12,02,Patatas
13,Menú de Hamburguesa con queso,12,04,Queso
14,Menú de Hamburguesa con queso,12,10,Nestea
15,Menú de Hamburguesa con queso,12,16,Tarta
16,Menú de Pollo,11,02,Patatas
17,Menú de Pollo,11,03,tomate
18,Menú de Pollo,11,06,Pollo
19,Menú de Pollo,11,17,Fruta
20,Menú de Pollo,11,18,Agua
21,Menú de Pollo con queso,13,02,Patatas
22,Menú de Pollo con queso,13,04,Queso
23,Menú de Pollo con queso,13,06,Pollo
24,Menú de Pollo con queso,13,08,Bacon
25,Menú de Pollo con queso,13,09,Coca cola
26,Menú de Pollo con queso,13,15,Helado